
<b><p align="center">Лабораторная работа 5</p></b>
<b><p align="center">Выполнил Мизинов Михаил НКАбд-04-25</p></b>

---



<b>Цель работы</b>

Настройка рабочей среды.

---


<b>Задание</b>

Настроить рабочую среды.

---


<b>Выполнение работы</b>

---


Менеджер паролей pass

Установка

![1 рисунок](images/1.png)

---


Настройка
![2 рисунок](images/2.png)


---


Настройка интерфейса с броузером

![3 рисунок](images/3.png)

---


Сохранение пароля
![4 рисунок](images/4.png)


---


Управление файлами конфигурации
Дополнительное программное обеспечение

![5 рисунок](images/5.png)

---


Установка бинарного файла и создание собственного репозитория с помощью утилит

![6 рисунок](images/6.png)

---

Подключение репозитория к своей системе

![7 рисунок](images/7.png)


---

Использование chezmoi на нескольких машинах

![8 рисунок](images/8.png)


---

Ежедневные операции c chezmoi

![9 рисунок](images/9.png)


---
<b>Вывод</b>

Успешно настроил рабочую среду.

