---
## Author
author:
  name: Мизинов Михаил Георгиевич
  degrees: BCs
  email: vsendtry1@gmail.com
  affiliation:
    - name: Российский университет дружбы народов
      country: Российская Федерация
      postal-code: 117198
      city: Москва
      address: ул. Миклухо-Маклая, д. 6

## Title
title: "3 отчёт по внешнему курсу"
subtitle: "Выполнение работы"
license: "CC BY"
---

# Цель работы

Научиться работе в ос Linux на базвом уровне.

# Задание

Выполнить курс на stepic. 2 этап

# Теоретическое введение

Курс выполнялся на платформе stepic.


# Выполнение лабораторной работы

Выполнение 1 задания (рис. 1).

![Задание 1](Images_stp/55.png)


Выполнение 2 задания (рис. 2).

![Задание 2](Images_stp/56.png)


Выполнение 3 задания (рис. 3).

![Задание 3](Images_stp/57.png)


Выполнение 4 задания (рис. 4).

![Задание 4](Images_stp/58.png)


Выполнение 5 задания (рис. 5).

![Задание 5](Images_stp/59.png)


Выполнение 6 задания (рис. 6).

![Задание 6](Images_stp/60.png)


Выполнение 7 задания (рис. 7).

![Задание 7](Images_stp/61.png)


Выполнение 8 задания (рис. 8).

![Задание 8](Images_stp/62.png)


Выполнение 9 задания (рис. 9).

![Задание 9](Images_stp/63.png)


Выполнение 10 задания (рис. 10).

![Задание 10](Images_stp/64.png)

Выполнение 11 задания (рис. 11).

![Задание 11](Images_stp/65.png)


Выполнение 12 задания (рис. 12).

![Задание 12](Images_stp/66.png)


Выполнение 13 задания (рис. 13).

![Задание 13](Images_stp/67.png)


Выполнение 14 задания (рис. 14).

![Задание 14](Images_stp/68.png)


Выполнение 15 задания (рис. 15).

![Задание 15](Images_stp/69.png)


Выполнение 16 задания (рис. 16).

![Задание 16](Images_stp/70.png)


Выполнение 17 задания (рис. 17).

![Задание 17](Images_stp/71.png)


Выполнение 18 задания (рис. 18).

![Задание 18](Images_stp/72.png)


Выполнение 19 задания (рис. 19).

![Задание 19](Images_stp/73.png)

Выполнение 20 задания (рис. 20).

![Задание 20](Images_stp/74.png)

Выполнение 21 задания (рис. 21).

![Задание 21](Images_stp/75.png)


Выполнение 22 задания (рис. 22).

![Задание 22](Images_stp/76.png)


Выполнение 23 задания (рис. 23).

![Задание 23](Images_stp/77.png)


Выполнение 24 задания (рис. 24).

![Задание 24](Images_stp/78.png)


Выполнение 25 задания (рис. 25).

![Задание 25](Images_stp/79.png)




Выполнение 26 задания (рис. 26).

![Задание 26](Images_stp/80.png)

Выполнение 27 задания (рис. 27).

![Задание 27](Images_stp/81.png)

Выполнение 28 задания (рис. 28).

![Задание 28](Images_stp/82.png)


Выполнение 29 задания (рис. 29).

![Задание 29](Images_stp/83.png)


Выполнение 30 задания (рис. 30).

![Задание 30](Images_stp/84.png)


Выполнение 31 задания (рис. 31).

![Задание 31](Images_stp/85.png)


Выполнение 32 задания (рис. 32).

![Задание 32](Images_stp/86.png)

Выполнение 33 задания (рис. 33).

![Задание 33](Images_stp/87.png)


Выполнение 34 задания (рис. 34).

![Задание 34](Images_stp/88.png)


Выполнение 35 задания (рис. 35).

![Задание 35](Images_stp/89.png)

# Выводы

Успешно выполнена 1 часть курса на stepic
