---
## Author
author:
  name: Мизинов Михаил Георгиевич
  degrees: BCs
  email: vsendtry1@gmail.com
  affiliation:
    - name: Российский университет дружбы народов
      country: Российская Федерация
      postal-code: 117198
      city: Москва
      address: ул. Миклухо-Маклая, д. 6

## Title
title: "2 отчёт по внешнему курсу"
subtitle: "Выполнение работы"
license: "CC BY"
---

# Цель работы

Научиться работе в ос Linux на базвом уровне.

---

# Задание

Выполнить курс на stepic. 2 этап

---


# Теоретическое введение

Курс выполнялся на платформе stepic.

---



# Выполнение лабораторной работы

---


Выполнение 1 задания (рис. 1).

![Задание 1](Images_stp/30.png)


---


Выполнение 2 задания (рис. 2).

![Задание 2](Images_stp/31.png)


---


Выполнение 3 задания (рис. 3).

![Задание 3](Images_stp/32.png)


---


Выполнение 4 задания (рис. 4).

![Задание 4](Images_stp/33.png)


---


Выполнение 5 задания (рис. 5).

![Задание 5](Images_stp/34.png)


---


Выполнение 6 задания (рис. 6).

![Задание 6](Images_stp/35.png)


---


Выполнение 7 задания (рис. 7).

![Задание 7](Images_stp/36.png)


---


Выполнение 8 задания (рис. 8).

![Задание 8](Images_stp/37.png)


---


Выполнение 9 задания (рис. 9).

![Задание 9](Images_stp/38.png)


---


Выполнение 10 задания (рис. 10).

![Задание 10](Images_stp/39.png)

---


Выполнение 11 задания (рис. 11).

![Задание 11](Images_stp/40.png)


---


Выполнение 12 задания (рис. 12).

![Задание 12](Images_stp/41.png)


---


Выполнение 13 задания (рис. 13).

![Задание 13](Images_stp/42.png)


---


Выполнение 14 задания (рис. 14).

![Задание 14](Images_stp/43.png)


---


Выполнение 15 задания (рис. 15).

![Задание 15](Images_stp/44.png)


---


Выполнение 16 задания (рис. 16).

![Задание 16](Images_stp/45.png)


---


Выполнение 17 задания (рис. 17).

![Задание 17](Images_stp/46.png)


---


Выполнение 18 задания (рис. 18).

![Задание 18](Images_stp/47.png)


---


Выполнение 19 задания (рис. 19).

![Задание 19](Images_stp/48.png)

---


Выполнение 20 задания (рис. 20).

![Задание 20](Images_stp/49.png)

---


Выполнение 21 задания (рис. 21).

![Задание 21](Images_stp/50.png)


---


Выполнение 22 задания (рис. 22).

![Задание 22](Images_stp/51.png)


---


Выполнение 23 задания (рис. 23).

![Задание 23](Images_stp/52.png)


---


Выполнение 24 задания (рис. 24).

![Задание 24](Images_stp/53.png)


---


Выполнение 25 задания (рис. 25).

![Задание 25](Images_stp/54.png)


---



# Выводы

Успешно выполнена 1 часть курса на stepic
